//;******************************************************************************
//;* Copyright (c) 1983-2013, Insyde Software Corporation. All Rights Reserved.
//;*
//;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
//;* transmit, broadcast, present, recite, release, license or otherwise exploit
//;* any part of this publication in any form, by any means, without the prior
//;* written permission of Insyde Software Corporation.
//;*
//;******************************************************************************

/=#

#include "Standard.uni"

/=#

#string STR_IPMI_CONFIG_FORM_TITLE                 #language en-US "H2O IPMI Configuration"
#string STR_IPMI_CONFIG_FORM_HELP                  #language en-US "Displays H2O IPMI and BMC information"
#string STR_BMC_STATUS                             #language en-US "BMC Status"
#string STR_CURRENT_BMC_STATUS                     #language en-US "N/A"
#string STR_BMC_MAC_ADDRESS           	           #language en-US "BMC MAC Address"
#string STR_CURRENT_BMC_MAC_ADDRESS                #language en-US "N/A"
#string STR_BMC_GATEWAY_MAC_ADDRESS           	   #language en-US "BMC Gateway MAC Address"
#string STR_CURRENT_BMC_GATEWAY_MAC_ADDRESS        #language en-US "N/A"
#string STR_BMC_FIRMWARE_VERSION                   #language en-US "BMC Firmware Version"
#string STR_CURRENT_BMC_FIRMWARE_VERSION           #language en-US "N/A"
#string STR_IPMI_SPEC_VERSION                      #language en-US "IPMI Specification Version"
#string STR_CURRENT_IPMI_SPEC_VERSION              #language en-US "N/A"
#string STR_IPMI_INTERFACE_TYPE                    #language en-US "System Interface Type"
#string STR_CURRENT_IPMI_INTERFACE_TYPE            #language en-US "N/A"
#string STR_IPMI_SMM_BASE_ADDRESS                  #language en-US "IPMI Base Address for SMM"
#string STR_CURRENT_IPMI_SMM_BASE_ADDRESS          #language en-US "N/A"
#string STR_IPMI_POST_BASE_ADDRESS                 #language en-US "IPMI Base Address for POST"
#string STR_CURRENT_IPMI_POST_BASE_ADDRESS         #language en-US "N/A"
#string STR_IPMI_OS_BASE_ADDRESS                   #language en-US "IPMI Base Address for OS"
#string STR_CURRENT_IPMI_OS_BASE_ADDRESS           #language en-US "N/A"
#string STR_EXECUTE_IPMI_UTILITY                   #language en-US "Execute H2O IPMI Utility"
#string STR_EXECUTE_IPMI_UTILITY_HELP              #language en-US "Execute H2O IPMI Utility"
#string STR_IPMI_SUPPORT                           #language en-US "IPMI Support"
#string STR_IPMI_SUPPORT_HELP                      #language en-US "Enable/Disable IPMI Support. Note: If changing to enable, BMC detailed information only valid after rebooting."
#string STR_BMC_WARMUP_TIME                        #language en-US "BMC Warmup Time"
#string STR_BMC_WARMUP_TIME_HELP                   #language en-US "A maximum waiting time period from POST to BMC ready in seconds. Please increase the value if your BMC needs longer time to get ready."
#string STR_IPMI_BOOT_OPTION                       #language en-US "Boot Option Support"
#string STR_IPMI_BOOT_OPTION_HELP                  #language en-US "Enable/Disable IPMI boot option function."
#string STR_IPMI_SEND_BIOS_VERSION                 #language en-US "Set BIOS version to BMC"
#string STR_IPMI_SEND_BIOS_VERSION_HELP            #language en-US "Enable/Disable set BIOS version to BMC. If the option is enabled, BIOS will send BIOS version string to BMC during POST."
#string STR_IPMI_SPMI_TABLE                        #language en-US "ACPI SPMI Table"
#string STR_IPMI_SPMI_TABLE_HELP                   #language en-US "Disabled/Enables the ACPI SPMI Table for IPMI driver installation."

#string STR_BMC_CONFIG_FORM_TITLE                  #language en-US "BMC Configuration"
#string STR_BMC_CONFIG_FORM_HELP                   #language en-US "BMC Configuration page. This page contains BMC realted settings."
#string STR_BMC_WATCHDOG_TIMER                     #language en-US "Watchdog Timer Support"
#string STR_BMC_WATCHDOG_TIMER_HELP                #language en-US "Enable/Disable BMC watchdog timer at start of POST."
#string STR_BMC_WATCHDOG_TIMER_TIMEOUT             #language en-US "Watchdog Timer Timeout"
#string STR_BMC_WATCHDOG_TIMER_TIMEOUT_HELP        #language en-US "Enter the number of minutes the system firmware has to boot the OS before it takes the Timeout Action. Valid values are from 2 to 8 minutes."
#string STR_BMC_WATCHDOG_TIMER_ACTION              #language en-US "Watchdog Timer Action"
#string STR_BMC_WATCHDOG_TIMER_ACTION_HELP         #language en-US "Timeout Action Choices: No Action, Hard Reset, Power Down or Power Cycle"
#string STR_BMC_WATCHDOG_TIMER_NO_ACTION           #language en-US "No Action"
#string STR_BMC_WATCHDOG_TIMER_HARD_RESET          #language en-US "Hard Reset"
#string STR_BMC_WATCHDOG_TIMER_POWER_DOWN          #language en-US "Power Down"
#string STR_BMC_WATCHDOG_TIMER_POWER_CYCLE         #language en-US "Power Cycle"
#string STR_BMC_POWER_CYCLE_SUPPORT                #language en-US "Power Cycle Time Support"
#string STR_BMC_POWER_CYCLE_SUPPORT_HELP           #language en-US "Enable/Disable send power cycle time command to BMC."
#string STR_BMC_POWER_CYCLE_TIME                   #language en-US "Power Cycle Time"
#string STR_BMC_POWER_CYCLE_TIME_HELP              #language en-US "The time that system power will be powered down during a power cycle operation initiated by the Chassis Control command or the watchdog time. Valid values are from 0 to 255 seconds."
#string STR_BMC_LAN_PORT_CONFIG                    #language en-US "Lan Port Configuration"
#string STR_BMC_LAN_PORT_CONFIG_HELP               #language en-US "Config the LAN port access mode."
#string STR_BMC_LAN_PORT_DEDICATED                 #language en-US "Dedicated"
#string STR_BMC_LAN_PORT_SHARED                    #language en-US "Shared"
#string STR_BMC_LAN_CHANNEL                        #language en-US "LAN Channel Number"
#string STR_BMC_LAN_CHANNEL_HELP                   #language en-US "Select the LAN channel number."
#string STR_BMC_IPV4_SOURCE                        #language en-US "IPv4 Source"
#string STR_BMC_IPV4_SOURCE_HELP                   #language en-US "DHCP: BMC IPv4 settings will be configured automatically by DHCP.\nStatic: BMC IPv4 settings will be configured manually"
#string STR_BMC_IPV4_SOURCE_DHCP                   #language en-US "DHCP"
#string STR_BMC_IPV4_SOURCE_STATIC                 #language en-US "Static"
#string STR_BMC_IPV4_IP_ADDRESS                    #language en-US "IPv4 IP Address"
#string STR_BMC_IPV4_IP_ADDRESS_HELP               #language en-US "Config BMC IPv4 IP Address."
#string STR_CURRENT_BMC_IPV4_IP_ADDRESS            #language en-US "N/A"
#string STR_BMC_IPV4_SUBNET_MASK                   #language en-US "IPv4 Subnet Mask"
#string STR_BMC_IPV4_SUBNET_MASK_HELP              #language en-US "Config BMC IPv4 Subnet Mask."
#string STR_CURRENT_BMC_IPV4_SUBNET_MASK           #language en-US "N/A"
#string STR_BMC_IPV4_GATEWAY_ADDRESS               #language en-US "IPv4 Gateway Address"
#string STR_BMC_IPV4_GATEWAY_ADDRESS_HELP          #language en-US "Config BMC IPv4 Gateway Address."
#string STR_CURRENT_BMC_IPV4_GATEWAY_ADDRESS       #language en-US "N/A"
#string STR_BMC_IPV6_MODE                          #language en-US "IPv6 Mode"
#string STR_BMC_IPV6_MODE_HELP                     #language en-US "Disables/Enables IPv6 internet protocol support."
#string STR_BMC_IPV6_AUTOCONFIG                    #language en-US "IPv6 AutoConfig"
#string STR_BMC_IPV6_AUTOCONFIG_HELP               #language en-US "Disables/Enables IPv6 auto configuration."
#string STR_BMC_IPV6_PREFIX_LENGTH                 #language en-US "IPv6 Prefix Length"
#string STR_BMC_IPV6_PREFIX_LENGTH_HELP            #language en-US "Set IPv6 prefix length."
#string STR_BMC_IPV6_IP_ADDRESS                    #language en-US "IPv6 IP Address"
#string STR_BMC_IPV6_IP_ADDRESS_HELP               #language en-US "Config BMC IPv6 IP Address."
#string STR_CURRENT_BMC_IPV6_IP_ADDRESS            #language en-US "N/A"
#string STR_BMC_IPV6_GATEWAY_ADDRESS               #language en-US "IPv6 Gateway Address"
#string STR_BMC_IPV6_GATEWAY_ADDRESS_HELP          #language en-US "Config BMC IPv6 Gateway Address."
#string STR_CURRENT_BMC_IPV6_GATEWAY_ADDRESS       #language en-US "N/A"
#string STR_BMC_FRONTPANEL_POWER_BUTTON            #language en-US "Power Button"
#string STR_BMC_FRONTPANEL_POWER_BUTTON_HELP       #language en-US "Enable/Disable power button function."
#string STR_BMC_FRONTPANEL_RESET_BUTTON            #language en-US "Reset Button"
#string STR_BMC_FRONTPANEL_RESET_BUTTON_HELP       #language en-US "Enable/Disable reset button function."
#string STR_BMC_FRONTPANEL_NMI_BUTTON              #language en-US "NMI Button"
#string STR_BMC_FRONTPANEL_NMI_BUTTON_HELP         #language en-US "Enable/Disable NMI button function."

#string STR_IPMI_SDR_LIST_TITLE                    #language en-US "SDR List"
#string STR_IPMI_SDR_LIST_HELP                     #language en-US "SDR List page. This page lists all SDRs information provide by BMC."
#string STR_IPMI_SDR_LIST_SUPPORT                  #language en-US "SDR List Support"
#string STR_IPMI_SDR_LIST_SUPPORT_HELP             #language en-US "Disable/Enable list all SDRs information."
#string STR_IPMI_SDR_LIST_FIELD_TITLE              #language en-US "  ID    Sensor Name         Value     Unit"